# PostEventArgs Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PostEventArgs Properties
PostEventArgs Class See Also
---
The PostEventArgs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Cancel | Indicates whether the event is being cancelled. When the event is cancellable, set the property to True to cancel it.  (Inherited from RevitEventArgs.) |
| Cancellable | Indicates whether an event may be cancelled by an event delegate.  (Inherited from RevitEventArgs.) |
| Status | Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an APIevent handler). |

# See Also
PostEventArgs Class
Autodesk.Revit.DB.Events Namespace